# Objectives

At the end of the experiment you will be able to 

* Understand importance of Pandas
* Perform data cleaning, manipulation using Pandas

## Features of Pandas

* Fast and efficient DataFrame object with default and customized indexing.
* Tools for loading data into in-memory data objects from different file formats.
* Data alignment and integrated handling of missing data.
* Reshaping and pivoting of date sets.
* Label-based slicing, indexing and subsetting of large data sets.
* Columns from a data structure can be deleted or inserted.
* Group by data for aggregation and transformations.
* High performance merging and joining of data.
* Time Series functionality.

Now it is time to work on practicals. Following Are the given Exercise:

### Excercise 1: How to import pandas and check the version?

In [0]:
# Your Code Here

### Excercise 2: Create a Series from Dictionary.

In [0]:
# Your Code Here

### Exercise 3: Create a DataFrame from Lists ; columns heading should be 'Name', 'Age'.

In [0]:
# Your Code Here

### Exercise 4: Create a DataFrame from List of Dictionaries.

In [0]:
# Your Code Here

### Exercise 5: frame a dataset using following data

In [0]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [0]:
# Your Code Here

### Exercise 6: In Ipl_data group the data by year

In [0]:
# Your Code Here

### Exercise 7: In Ipl_data group the data by Team and year

In [0]:
# Your Code Here

### Exercise 8: Iterating through Groups using year

In [0]:
# Your Code Here

### Exercise 9: Group the data and get only 2014 year

In [0]:
# Your Code Here

### Exercise 10: In points do the mean using .agg i.e aggregate

In [0]:
# Your Code Here

### Exercise 11: Find size of dataset using **.agg** based on team

In [0]:
# Your Code Here

### Exercise 12: Create two Dataframes name it as 'left' and other 'right' using following data

In [0]:
# Your Code Here

### Exercise 13: Merge the left and right based on 'id'

In [0]:
# Your Code Here

### Exercise 14: Merge the left and right based on 'id' and 'subject_id'

In [0]:
# Your Code Here

### Exercise 15: Merge the left and right based on 'subject_id' ,left join

In [0]:
# Your Code Here

### Exercise 16: Merge the left and right based on 'subject_id' ,right join

In [0]:
# Your Code Here

### Exercise 17: Merge the left and right based on 'subject_id' ,outter join

In [0]:
# Your Code Here

### Exercise 18: Merge the left and right based on 'subject_id' ,inner join

In [0]:
# Your Code Here

### Exercise 19: Concatinate two dataframes using following data and the index should not repeat

In [21]:
import pandas as pd
data1 = {'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 'subject_id':['sub1','sub2','sub4','sub6','sub5'], 'Marks_scored':[98,90,87,69,78]}
data2 = {'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 'subject_id':['sub2','sub4','sub3','sub6','sub5'], 'Marks_scored':[89,80,79,97,88]}
df1 = pd.DataFrame.from_dict(data1)
df2 = pd.DataFrame.from_dict(data2)
pd.concat([df1,df2])
df1

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78

### Exercise 20: Change the header names of given data using .read_csv

In [14]:
df# Your Code Here

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78

In [8]:
data = {'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 'subject_id': ['sub2','sub4','sub3','sub6','sub5'], 'Marks_scored':[89,80,79,97,88]}
df1 = pd.DataFrame.from_dict(data)
df1

    Name subject_id  Marks_scored
0  Billy       sub2            89
1  Brian       sub4            80
2   Bran       sub3            79
3  Bryce       sub6            97
4  Betty       sub5            88